{
  "_name_or_path": "motheecreator/vit-Facial-Expression-Recognition",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "neutral",
    "1": "happiness",
    "2": "surprise",
    "3": "sadness",
    "4": "anger",
    "5": "disgust",
    "6": "fear",
    "7": "contempt"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "anger": 4,
    "contempt": 7,
    "disgust": 5,
    "fear": 6,
    "happiness": 1,
    "neutral": 0,
    "sadness": 3,
    "surprise": 2
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.46.2"
}
